Tekla.Structures.Drawing.MarkBase
The MarkBase class contains general mark information and can be
selected and modified with the general attributes.
The following example enumerates through all marks in all views and changes
their frame types to sharpened and their frame colors to red.
using Tekla.Structures.Drawing;
public class Example
{
public void Example1()
{
DrawingHandler MyDrawingHandler = new DrawingHandler();
if(MyDrawingHandler.GetConnectionStatus())
{
MarkBase MyMarkBase;
DrawingObjectEnumerator views = MyDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews();
while(views.MoveNext())
{
DrawingObjectEnumerator allObjects = (views.Current as ViewBase).GetAllObjects();
while(allObjects.MoveNext())
{
if(allObjects.Current is MarkBase)
{
MyMarkBase = allObjects.Current as MarkBase;
MyMarkBase.Attributes.Frame.Color = DrawingColors.Red;
MyMarkBase.Attributes.Frame.Type = FrameTypes.Sharpened;
MyMarkBase.Modify();
}
}
}
}
}
}

Tekla.Structures.Drawing.MarkBase.Attributes
Gets or sets the mark base attributes.

Tekla.Structures.Drawing.MarkBase.InsertionPoint
The insertion point of the mark.

Tekla.Structures.Drawing.MarkBase.TextWidth
The width of the text frame.

Tekla.Structures.Drawing.MarkBase.TextHeight
The height of the text frame.

Tekla.Structures.Drawing.MarkBase.Placing
The current placing of the object.
See the placing types for different placing options.

Tekla.Structures.Drawing.MarkBase.IsAssociativeNote
Gets a value indicating whether the mark is an associative note.

Tekla.Structures.Drawing.MarkBase.GetAxisAlignedBoundingBox
Returns the axis aligned bounding box of the text (rectangle format).
Returns: The bounding box of the text.

Tekla.Structures.Drawing.MarkBase.GetObjectAlignedBoundingBox
Returns the object aligned bounding box of the text (rectangle format).
Returns: The bounding box of the text.

Tekla.Structures.Drawing.MarkBase.MoveObjectRelative(Tekla.Structures.Geometry3d.Vector)
Moves the object using the move vector.
MoveVector: The move vector to be used.
Returns: True.

Tekla.Structures.Drawing.MarkBase.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point)
MarkBase constructor without a leaderline

Tekla.Structures.Drawing.MarkBase.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.LeaderLine)
Create a mark instance with a leader line to mark

Tekla.Structures.Drawing.MarkBase.GetObjects
Gets the children objects of the current object.
Returns: The children objects of the current object.

Tekla.Structures.Drawing.MarkBase.GetObjects(System.Type[])
Gets the children objects of the current object that are of certain types.
TypeFilter: The types of the objects to get.
Returns: The children objects of the current object that are of certain types.

Tekla.Structures.Drawing.MarkBase.Hideable
Accesses the information if this object is hidden or not or if it should be.